analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spimss_regs.h
#define MXC_F_SPIMSS_INT_FL_TUND_POS                   2 /**< INT_FL_TUND Position */
#define MXC_F_SPIMSS_INT_FL_TUND                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_INT_FL_TUND_POS)) /**< INT_FL_TUND Mask */
#define MXC_V_SPIMSS_INT_FL_TUND_NOEVENT               ((uint32_t)0x0UL) /**< INT_FL_TUND_NOEVENT Value */
#define MXC_S_SPIMSS_INT_FL_TUND_NOEVENT               (MXC_V_SPIMSS_INT_FL_TUND_NOEVENT << MXC_F_SPIMSS_INT_FL_TUND_POS) /**< INT_FL_TUND_NOEVENT Setting */
#define MXC_V_SPIMSS_INT_FL_TUND_UNDERRUN              ((uint32_t)0x1UL) /**< INT_FL_TUND_UNDERRUN Value */
#define MXC_S_SPIMSS_INT_FL_TUND_UNDERRUN              (MXC_V_SPIMSS_INT_FL_TUND_UNDERRUN << MXC_F_SPIMSS_INT_FL_TUND_POS) /**< INT_FL_TUND_UNDERRUN Setting */

#define MXC_F_SPIMSS_INT_FL_ROVR_POS                   3 /**< INT_FL_ROVR Position */
#define MXC_F_SPIMSS_INT_FL_ROVR                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_INT_FL_ROVR_POS)) /**< INT_FL_ROVR Mask */
#define MXC_V_SPIMSS_INT_FL_ROVR_NOEVENT               ((uint32_t)0x0UL) /**< INT_FL_ROVR_NOEVENT Value */
#define MXC_S_SPIMSS_INT_FL_ROVR_NOEVENT               (MXC_V_SPIMSS_INT_FL_ROVR_NOEVENT << MXC_F_SPIMSS_INT_FL_ROVR_POS) /**< INT_FL_ROVR_NOEVENT Setting */
#define MXC_V_SPIMSS_INT_FL_ROVR_OVERRUN               ((uint32_t)0x1UL) /**< INT_FL_ROVR_OVERRUN Value */
#define MXC_S_SPIMSS_INT_FL_ROVR_OVERRUN               (MXC_V_SPIMSS_INT_FL_ROVR_OVERRUN << MXC_F_SPIMSS_INT_FL_ROVR_POS) /**< INT_FL_ROVR_OVERRUN Setting */

#define MXC_F_SPIMSS_INT_FL_ABT_POS                    4 /**< INT_FL_ABT Position */
#define MXC_F_SPIMSS_INT_FL_ABT                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_INT_FL_ABT_POS)) /**< INT_FL_ABT Mask */
#define MXC_V_SPIMSS_INT_FL_ABT_NOEVENT                ((uint32_t)0x0UL) /**< INT_FL_ABT_NOEVENT Value */
#define MXC_S_SPIMSS_INT_FL_ABT_NOEVENT                (MXC_V_SPIMSS_INT_FL_ABT_NOEVENT << MXC_F_SPIMSS_INT_FL_ABT_POS) /**< INT_FL_ABT_NOEVENT Setting */
#define MXC_V_SPIMSS_INT_FL_ABT_ABORTED                ((uint32_t)0x1UL) /**< INT_FL_ABT_ABORTED Value */
#define MXC_S_SPIMSS_INT_FL_ABT_ABORTED                (MXC_V_SPIMSS_INT_FL_ABT_ABORTED << MXC_F_SPIMSS_INT_FL_ABT_POS) /**< INT_FL_ABT_ABORTED Setting */

#define MXC_F_SPIMSS_INT_FL_COL_POS                    5 /**< INT_FL_COL Position */
#define MXC_F_SPIMSS_INT_FL_COL                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_INT_FL_COL_POS)) /**< INT_FL_COL Mask */
#define MXC_V_SPIMSS_INT_FL_COL_NOEVENT                ((uint32_t)0x0UL) /**< INT_FL_COL_NOEVENT Value */
#define MXC_S_SPIMSS_INT_FL_COL_NOEVENT                (MXC_V_SPIMSS_INT_FL_COL_NOEVENT << MXC_F_SPIMSS_INT_FL_COL_POS) /**< INT_FL_COL_NOEVENT Setting */
#define MXC_V_SPIMSS_INT_FL_COL_COLLISION              ((uint32_t)0x1UL) /**< INT_FL_COL_COLLISION Value */
#define MXC_S_SPIMSS_INT_FL_COL_COLLISION              (MXC_V_SPIMSS_INT_FL_COL_COLLISION << MXC_F_SPIMSS_INT_FL_COL_POS) /**< INT_FL_COL_COLLISION Setting */

#define MXC_F_SPIMSS_INT_FL_TOVR_POS                   6 /**< INT_FL_TOVR Position */
#define MXC_F_SPIMSS_INT_FL_TOVR                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_INT_FL_TOVR_POS)) /**< INT_FL_TOVR Mask */
#define MXC_V_SPIMSS_INT_FL_TOVR_NOEVENT               ((uint32_t)0x0UL) /**< INT_FL_TOVR_NOEVENT Value */
#define MXC_S_SPIMSS_INT_FL_TOVR_NOEVENT               (MXC_V_SPIMSS_INT_FL_TOVR_NOEVENT << MXC_F_SPIMSS_INT_FL_TOVR_POS) /**< INT_FL_TOVR_NOEVENT Setting */
#define MXC_V_SPIMSS_INT_FL_TOVR_OVERRUN               ((uint32_t)0x1UL) /**< INT_FL_TOVR_OVERRUN Value */
#define MXC_S_SPIMSS_INT_FL_TOVR_OVERRUN               (MXC_V_SPIMSS_INT_FL_TOVR_OVERRUN << MXC_F_SPIMSS_INT_FL_TOVR_POS) /**< INT_FL_TOVR_OVERRUN Setting */

#define MXC_F_SPIMSS_INT_FL_IRQ_POS                    7 /**< INT_FL_IRQ Position */
#define MXC_F_SPIMSS_INT_FL_IRQ                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_INT_FL_IRQ_POS)) /**< INT_FL_IRQ Mask */
#define MXC_V_SPIMSS_INT_FL_IRQ_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL_IRQ_INACTIVE Value */
#define MXC_S_SPIMSS_INT_FL_IRQ_INACTIVE               (MXC_V_SPIMSS_INT_FL_IRQ_INACTIVE << MXC_F_SPIMSS_INT_FL_IRQ_POS) /**< INT_FL_IRQ_INACTIVE Setting */
#define MXC_V_SPIMSS_INT_FL_IRQ_PENDING                ((uint32_t)0x1UL) /**< INT_FL_IRQ_PENDING Value */
#define MXC_S_SPIMSS_INT_FL_IRQ_PENDING                (MXC_V_SPIMSS_INT_FL_IRQ_PENDING << MXC_F_SPIMSS_INT_FL_IRQ_POS) /**< INT_FL_IRQ_PENDING Setting */

/**@} end of group SPIMSS_INT_FL_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_MOD SPIMSS_MOD
 * @brief    SPI Mode Register.
 * @{
 */
#define MXC_F_SPIMSS_MOD_SSV_POS                       0 /**< MOD_SSV Position */
#define MXC_F_SPIMSS_MOD_SSV                           ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSV_POS)) /**< MOD_SSV Mask */
#define MXC_V_SPIMSS_MOD_SSV_LO                        ((uint32_t)0x0UL) /**< MOD_SSV_LO Value */
#define MXC_S_SPIMSS_MOD_SSV_LO                        (MXC_V_SPIMSS_MOD_SSV_LO << MXC_F_SPIMSS_MOD_SSV_POS) /**< MOD_SSV_LO Setting */
#define MXC_V_SPIMSS_MOD_SSV_HI                        ((uint32_t)0x1UL) /**< MOD_SSV_HI Value */
#define MXC_S_SPIMSS_MOD_SSV_HI                        (MXC_V_SPIMSS_MOD_SSV_HI << MXC_F_SPIMSS_MOD_SSV_POS) /**< MOD_SSV_HI Setting */

#define MXC_F_SPIMSS_MOD_SSEL_POS                      1 /**< MOD_SSEL Position */
#define MXC_F_SPIMSS_MOD_SSEL                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSEL_POS)) /**< MOD_SSEL Mask */
#define MXC_V_SPIMSS_MOD_SSEL_INPUT                    ((uint32_t)0x0UL) /**< MOD_SSEL_INPUT Value */
#define MXC_S_SPIMSS_MOD_SSEL_INPUT                    (MXC_V_SPIMSS_MOD_SSEL_INPUT << MXC_F_SPIMSS_MOD_SSEL_POS) /**< MOD_SSEL_INPUT Setting */
#define MXC_V_SPIMSS_MOD_SSEL_OUTPUT                   ((uint32_t)0x1UL) /**< MOD_SSEL_OUTPUT Value */
#define MXC_S_SPIMSS_MOD_SSEL_OUTPUT                   (MXC_V_SPIMSS_MOD_SSEL_OUTPUT << MXC_F_SPIMSS_MOD_SSEL_POS) /**< MOD_SSEL_OUTPUT Setting */

#define MXC_F_SPIMSS_MOD_NUMBITS_POS                   2 /**< MOD_NUMBITS Position */
#define MXC_F_SPIMSS_MOD_NUMBITS                       ((uint32_t)(0xFUL << MXC_F_SPIMSS_MOD_NUMBITS_POS)) /**< MOD_NUMBITS Mask */
#define MXC_V_SPIMSS_MOD_NUMBITS_16BITS                ((uint32_t)0x0UL) /**< MOD_NUMBITS_16BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_16BITS                (MXC_V_SPIMSS_MOD_NUMBITS_16BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_16BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_1BITS                 ((uint32_t)0x1UL) /**< MOD_NUMBITS_1BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_1BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_1BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_1BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_2BITS                 ((uint32_t)0x2UL) /**< MOD_NUMBITS_2BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_2BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_2BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_2BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_3BITS                 ((uint32_t)0x3UL) /**< MOD_NUMBITS_3BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_3BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_3BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_3BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_4BITS                 ((uint32_t)0x4UL) /**< MOD_NUMBITS_4BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_4BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_4BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_4BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_5BITS                 ((uint32_t)0x5UL) /**< MOD_NUMBITS_5BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_5BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_5BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_5BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_6BITS                 ((uint32_t)0x6UL) /**< MOD_NUMBITS_6BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_6BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_6BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_6BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_7BITS                 ((uint32_t)0x7UL) /**< MOD_NUMBITS_7BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_7BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_7BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_7BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_8BITS                 ((uint32_t)0x8UL) /**< MOD_NUMBITS_8BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_8BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_8BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_8BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_9BITS                 ((uint32_t)0x9UL) /**< MOD_NUMBITS_9BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_9BITS                 (MXC_V_SPIMSS_MOD_NUMBITS_9BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_9BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_10BITS                ((uint32_t)0xAUL) /**< MOD_NUMBITS_10BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_10BITS                (MXC_V_SPIMSS_MOD_NUMBITS_10BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_10BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_11BITS                ((uint32_t)0xBUL) /**< MOD_NUMBITS_11BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_11BITS                (MXC_V_SPIMSS_MOD_NUMBITS_11BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_11BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_12BITS                ((uint32_t)0xCUL) /**< MOD_NUMBITS_12BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_12BITS                (MXC_V_SPIMSS_MOD_NUMBITS_12BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_12BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_13BITS                ((uint32_t)0xDUL) /**< MOD_NUMBITS_13BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_13BITS                (MXC_V_SPIMSS_MOD_NUMBITS_13BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_13BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_14BITS                ((uint32_t)0xEUL) /**< MOD_NUMBITS_14BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_14BITS                (MXC_V_SPIMSS_MOD_NUMBITS_14BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_14BITS Setting */
#define MXC_V_SPIMSS_MOD_NUMBITS_15BITS                ((uint32_t)0xFUL) /**< MOD_NUMBITS_15BITS Value */
#define MXC_S_SPIMSS_MOD_NUMBITS_15BITS                (MXC_V_SPIMSS_MOD_NUMBITS_15BITS << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_15BITS Setting */

#define MXC_F_SPIMSS_MOD_TX_ALIGN_POS                  7 /**< MOD_TX_ALIGN Position */
#define MXC_F_SPIMSS_MOD_TX_ALIGN                      ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_TX_ALIGN_POS)) /**< MOD_TX_ALIGN Mask */
#define MXC_V_SPIMSS_MOD_TX_ALIGN_LSB                  ((uint32_t)0x0UL) /**< MOD_TX_ALIGN_LSB Value */
#define MXC_S_SPIMSS_MOD_TX_ALIGN_LSB                  (MXC_V_SPIMSS_MOD_TX_ALIGN_LSB << MXC_F_SPIMSS_MOD_TX_ALIGN_POS) /**< MOD_TX_ALIGN_LSB Setting */
#define MXC_V_SPIMSS_MOD_TX_ALIGN_MSB                  ((uint32_t)0x1UL) /**< MOD_TX_ALIGN_MSB Value */
#define MXC_S_SPIMSS_MOD_TX_ALIGN_MSB                  (MXC_V_SPIMSS_MOD_TX_ALIGN_MSB << MXC_F_SPIMSS_MOD_TX_ALIGN_POS) /**< MOD_TX_ALIGN_MSB Setting */

/**@} end of group SPIMSS_MOD_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_BRG SPIMSS_BRG
 * @brief    Baud Rate Reload Value. The SPI Baud Rate register is a 16-bit reload value for
 *           the SPI Baud Rate Generator. The reload value must be greater than or equal to
 *           0002H for proper SPI operation (maximum baud rate is PCLK frequency divided by
 *           4).
 * @{
 */
#define MXC_F_SPIMSS_BRG_DIV_POS                       0 /**< BRG_DIV Position */
#define MXC_F_SPIMSS_BRG_DIV                           ((uint32_t)(0xFFFFUL << MXC_F_SPIMSS_BRG_DIV_POS)) /**< BRG_DIV Mask */

/**@} end of group SPIMSS_BRG_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_DMA SPIMSS_DMA
 * @brief    SPI DMA Register.
 * @{
 */
#define MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS               0 /**< DMA_TX_FIFO_LVL Position */
#define MXC_F_SPIMSS_DMA_TX_FIFO_LVL                   ((uint32_t)(0x7UL << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS)) /**< DMA_TX_FIFO_LVL Mask */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_1ENTRIES          ((uint32_t)0x0UL) /**< DMA_TX_FIFO_LVL_1ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_1ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_1ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_1ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_2ENTRIES          ((uint32_t)0x1UL) /**< DMA_TX_FIFO_LVL_2ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_2ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_2ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_2ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_3ENTRIES          ((uint32_t)0x2UL) /**< DMA_TX_FIFO_LVL_3ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_3ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_3ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_3ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_4ENTRIES          ((uint32_t)0x3UL) /**< DMA_TX_FIFO_LVL_4ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_4ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_4ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_4ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_5ENTRIES          ((uint32_t)0x4UL) /**< DMA_TX_FIFO_LVL_5ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_5ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_5ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_5ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_6ENTRIES          ((uint32_t)0x5UL) /**< DMA_TX_FIFO_LVL_6ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_6ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_6ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_6ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_7ENTRIES          ((uint32_t)0x6UL) /**< DMA_TX_FIFO_LVL_7ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_7ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_7ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_7ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_TX_FIFO_LVL_8ENTRIES          ((uint32_t)0x7UL) /**< DMA_TX_FIFO_LVL_8ENTRIES Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_LVL_8ENTRIES          (MXC_V_SPIMSS_DMA_TX_FIFO_LVL_8ENTRIES << MXC_F_SPIMSS_DMA_TX_FIFO_LVL_POS) /**< DMA_TX_FIFO_LVL_8ENTRIES Setting */

#define MXC_F_SPIMSS_DMA_TX_FIFO_CLR_POS               4 /**< DMA_TX_FIFO_CLR Position */
#define MXC_F_SPIMSS_DMA_TX_FIFO_CLR                   ((uint32_t)(0x1UL << MXC_F_SPIMSS_DMA_TX_FIFO_CLR_POS)) /**< DMA_TX_FIFO_CLR Mask */
#define MXC_V_SPIMSS_DMA_TX_FIFO_CLR_CLEAR             ((uint32_t)0x1UL) /**< DMA_TX_FIFO_CLR_CLEAR Value */
#define MXC_S_SPIMSS_DMA_TX_FIFO_CLR_CLEAR             (MXC_V_SPIMSS_DMA_TX_FIFO_CLR_CLEAR << MXC_F_SPIMSS_DMA_TX_FIFO_CLR_POS) /**< DMA_TX_FIFO_CLR_CLEAR Setting */

