analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spimss_regs.h
#define MXC_F_SPIMSS_DMA_TX_FIFO_CNT_POS               8 /**< DMA_TX_FIFO_CNT Position */
#define MXC_F_SPIMSS_DMA_TX_FIFO_CNT                   ((uint32_t)(0xFUL << MXC_F_SPIMSS_DMA_TX_FIFO_CNT_POS)) /**< DMA_TX_FIFO_CNT Mask */

#define MXC_F_SPIMSS_DMA_TX_DMA_EN_POS                 15 /**< DMA_TX_DMA_EN Position */
#define MXC_F_SPIMSS_DMA_TX_DMA_EN                     ((uint32_t)(0x1UL << MXC_F_SPIMSS_DMA_TX_DMA_EN_POS)) /**< DMA_TX_DMA_EN Mask */
#define MXC_V_SPIMSS_DMA_TX_DMA_EN_DIS                 ((uint32_t)0x0UL) /**< DMA_TX_DMA_EN_DIS Value */
#define MXC_S_SPIMSS_DMA_TX_DMA_EN_DIS                 (MXC_V_SPIMSS_DMA_TX_DMA_EN_DIS << MXC_F_SPIMSS_DMA_TX_DMA_EN_POS) /**< DMA_TX_DMA_EN_DIS Setting */
#define MXC_V_SPIMSS_DMA_TX_DMA_EN_EN                  ((uint32_t)0x1UL) /**< DMA_TX_DMA_EN_EN Value */
#define MXC_S_SPIMSS_DMA_TX_DMA_EN_EN                  (MXC_V_SPIMSS_DMA_TX_DMA_EN_EN << MXC_F_SPIMSS_DMA_TX_DMA_EN_POS) /**< DMA_TX_DMA_EN_EN Setting */

#define MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS               16 /**< DMA_RX_FIFO_LVL Position */
#define MXC_F_SPIMSS_DMA_RX_FIFO_LVL                   ((uint32_t)(0x7UL << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS)) /**< DMA_RX_FIFO_LVL Mask */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_1ENTRIES          ((uint32_t)0x0UL) /**< DMA_RX_FIFO_LVL_1ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_1ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_1ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_1ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_2ENTRIES          ((uint32_t)0x1UL) /**< DMA_RX_FIFO_LVL_2ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_2ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_2ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_2ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_3ENTRIES          ((uint32_t)0x2UL) /**< DMA_RX_FIFO_LVL_3ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_3ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_3ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_3ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_4ENTRIES          ((uint32_t)0x3UL) /**< DMA_RX_FIFO_LVL_4ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_4ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_4ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_4ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_5ENTRIES          ((uint32_t)0x4UL) /**< DMA_RX_FIFO_LVL_5ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_5ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_5ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_5ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_6ENTRIES          ((uint32_t)0x5UL) /**< DMA_RX_FIFO_LVL_6ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_6ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_6ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_6ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_7ENTRIES          ((uint32_t)0x6UL) /**< DMA_RX_FIFO_LVL_7ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_7ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_7ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_7ENTRIES Setting */
#define MXC_V_SPIMSS_DMA_RX_FIFO_LVL_8ENTRIES          ((uint32_t)0x7UL) /**< DMA_RX_FIFO_LVL_8ENTRIES Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_LVL_8ENTRIES          (MXC_V_SPIMSS_DMA_RX_FIFO_LVL_8ENTRIES << MXC_F_SPIMSS_DMA_RX_FIFO_LVL_POS) /**< DMA_RX_FIFO_LVL_8ENTRIES Setting */

#define MXC_F_SPIMSS_DMA_RX_FIFO_CLR_POS               20 /**< DMA_RX_FIFO_CLR Position */
#define MXC_F_SPIMSS_DMA_RX_FIFO_CLR                   ((uint32_t)(0x1UL << MXC_F_SPIMSS_DMA_RX_FIFO_CLR_POS)) /**< DMA_RX_FIFO_CLR Mask */
#define MXC_V_SPIMSS_DMA_RX_FIFO_CLR_CLEAR             ((uint32_t)0x1UL) /**< DMA_RX_FIFO_CLR_CLEAR Value */
#define MXC_S_SPIMSS_DMA_RX_FIFO_CLR_CLEAR             (MXC_V_SPIMSS_DMA_RX_FIFO_CLR_CLEAR << MXC_F_SPIMSS_DMA_RX_FIFO_CLR_POS) /**< DMA_RX_FIFO_CLR_CLEAR Setting */

#define MXC_F_SPIMSS_DMA_RX_FIFO_CNT_POS               24 /**< DMA_RX_FIFO_CNT Position */
#define MXC_F_SPIMSS_DMA_RX_FIFO_CNT                   ((uint32_t)(0xFUL << MXC_F_SPIMSS_DMA_RX_FIFO_CNT_POS)) /**< DMA_RX_FIFO_CNT Mask */

#define MXC_F_SPIMSS_DMA_RX_DMA_EN_POS                 31 /**< DMA_RX_DMA_EN Position */
#define MXC_F_SPIMSS_DMA_RX_DMA_EN                     ((uint32_t)(0x1UL << MXC_F_SPIMSS_DMA_RX_DMA_EN_POS)) /**< DMA_RX_DMA_EN Mask */
#define MXC_V_SPIMSS_DMA_RX_DMA_EN_DIS                 ((uint32_t)0x0UL) /**< DMA_RX_DMA_EN_DIS Value */
#define MXC_S_SPIMSS_DMA_RX_DMA_EN_DIS                 (MXC_V_SPIMSS_DMA_RX_DMA_EN_DIS << MXC_F_SPIMSS_DMA_RX_DMA_EN_POS) /**< DMA_RX_DMA_EN_DIS Setting */
#define MXC_V_SPIMSS_DMA_RX_DMA_EN_EN                  ((uint32_t)0x1UL) /**< DMA_RX_DMA_EN_EN Value */
#define MXC_S_SPIMSS_DMA_RX_DMA_EN_EN                  (MXC_V_SPIMSS_DMA_RX_DMA_EN_EN << MXC_F_SPIMSS_DMA_RX_DMA_EN_POS) /**< DMA_RX_DMA_EN_EN Setting */

/**@} end of group SPIMSS_DMA_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_I2S_CTRL SPIMSS_I2S_CTRL
 * @brief    I2S Control Register.
 * @{
 */
#define MXC_F_SPIMSS_I2S_CTRL_I2S_EN_POS               0 /**< I2S_CTRL_I2S_EN Position */
#define MXC_F_SPIMSS_I2S_CTRL_I2S_EN                   ((uint32_t)(0x1UL << MXC_F_SPIMSS_I2S_CTRL_I2S_EN_POS)) /**< I2S_CTRL_I2S_EN Mask */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_EN_DIS               ((uint32_t)0x0UL) /**< I2S_CTRL_I2S_EN_DIS Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_EN_DIS               (MXC_V_SPIMSS_I2S_CTRL_I2S_EN_DIS << MXC_F_SPIMSS_I2S_CTRL_I2S_EN_POS) /**< I2S_CTRL_I2S_EN_DIS Setting */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_EN_EN                ((uint32_t)0x1UL) /**< I2S_CTRL_I2S_EN_EN Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_EN_EN                (MXC_V_SPIMSS_I2S_CTRL_I2S_EN_EN << MXC_F_SPIMSS_I2S_CTRL_I2S_EN_POS) /**< I2S_CTRL_I2S_EN_EN Setting */

#define MXC_F_SPIMSS_I2S_CTRL_I2S_MUTE_POS             1 /**< I2S_CTRL_I2S_MUTE Position */
#define MXC_F_SPIMSS_I2S_CTRL_I2S_MUTE                 ((uint32_t)(0x1UL << MXC_F_SPIMSS_I2S_CTRL_I2S_MUTE_POS)) /**< I2S_CTRL_I2S_MUTE Mask */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_MUTE_NORMAL          ((uint32_t)0x0UL) /**< I2S_CTRL_I2S_MUTE_NORMAL Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_MUTE_NORMAL          (MXC_V_SPIMSS_I2S_CTRL_I2S_MUTE_NORMAL << MXC_F_SPIMSS_I2S_CTRL_I2S_MUTE_POS) /**< I2S_CTRL_I2S_MUTE_NORMAL Setting */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_MUTE_MUTED           ((uint32_t)0x1UL) /**< I2S_CTRL_I2S_MUTE_MUTED Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_MUTE_MUTED           (MXC_V_SPIMSS_I2S_CTRL_I2S_MUTE_MUTED << MXC_F_SPIMSS_I2S_CTRL_I2S_MUTE_POS) /**< I2S_CTRL_I2S_MUTE_MUTED Setting */

#define MXC_F_SPIMSS_I2S_CTRL_I2S_PAUSE_POS            2 /**< I2S_CTRL_I2S_PAUSE Position */
#define MXC_F_SPIMSS_I2S_CTRL_I2S_PAUSE                ((uint32_t)(0x1UL << MXC_F_SPIMSS_I2S_CTRL_I2S_PAUSE_POS)) /**< I2S_CTRL_I2S_PAUSE Mask */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_PAUSE_NORMAL         ((uint32_t)0x0UL) /**< I2S_CTRL_I2S_PAUSE_NORMAL Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_PAUSE_NORMAL         (MXC_V_SPIMSS_I2S_CTRL_I2S_PAUSE_NORMAL << MXC_F_SPIMSS_I2S_CTRL_I2S_PAUSE_POS) /**< I2S_CTRL_I2S_PAUSE_NORMAL Setting */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_PAUSE_PAUSE          ((uint32_t)0x1UL) /**< I2S_CTRL_I2S_PAUSE_PAUSE Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_PAUSE_PAUSE          (MXC_V_SPIMSS_I2S_CTRL_I2S_PAUSE_PAUSE << MXC_F_SPIMSS_I2S_CTRL_I2S_PAUSE_POS) /**< I2S_CTRL_I2S_PAUSE_PAUSE Setting */

#define MXC_F_SPIMSS_I2S_CTRL_I2S_MONO_POS             3 /**< I2S_CTRL_I2S_MONO Position */
#define MXC_F_SPIMSS_I2S_CTRL_I2S_MONO                 ((uint32_t)(0x1UL << MXC_F_SPIMSS_I2S_CTRL_I2S_MONO_POS)) /**< I2S_CTRL_I2S_MONO Mask */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_MONO_STEREO          ((uint32_t)0x0UL) /**< I2S_CTRL_I2S_MONO_STEREO Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_MONO_STEREO          (MXC_V_SPIMSS_I2S_CTRL_I2S_MONO_STEREO << MXC_F_SPIMSS_I2S_CTRL_I2S_MONO_POS) /**< I2S_CTRL_I2S_MONO_STEREO Setting */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_MONO_MONO            ((uint32_t)0x1UL) /**< I2S_CTRL_I2S_MONO_MONO Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_MONO_MONO            (MXC_V_SPIMSS_I2S_CTRL_I2S_MONO_MONO << MXC_F_SPIMSS_I2S_CTRL_I2S_MONO_POS) /**< I2S_CTRL_I2S_MONO_MONO Setting */

#define MXC_F_SPIMSS_I2S_CTRL_I2S_LJ_POS               4 /**< I2S_CTRL_I2S_LJ Position */
#define MXC_F_SPIMSS_I2S_CTRL_I2S_LJ                   ((uint32_t)(0x1UL << MXC_F_SPIMSS_I2S_CTRL_I2S_LJ_POS)) /**< I2S_CTRL_I2S_LJ Mask */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_LJ_LAG               ((uint32_t)0x0UL) /**< I2S_CTRL_I2S_LJ_LAG Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_LJ_LAG               (MXC_V_SPIMSS_I2S_CTRL_I2S_LJ_LAG << MXC_F_SPIMSS_I2S_CTRL_I2S_LJ_POS) /**< I2S_CTRL_I2S_LJ_LAG Setting */
#define MXC_V_SPIMSS_I2S_CTRL_I2S_LJ_SYNCRONIZED       ((uint32_t)0x1UL) /**< I2S_CTRL_I2S_LJ_SYNCRONIZED Value */
#define MXC_S_SPIMSS_I2S_CTRL_I2S_LJ_SYNCRONIZED       (MXC_V_SPIMSS_I2S_CTRL_I2S_LJ_SYNCRONIZED << MXC_F_SPIMSS_I2S_CTRL_I2S_LJ_POS) /**< I2S_CTRL_I2S_LJ_SYNCRONIZED Setting */

/**@} end of group SPIMSS_I2S_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SPIMSS_REGS_H_
